"CIAdditionCompositing" = "Adiciona componentes de cor para obter um efeito brilhante. Este filtro é geralmente utilizado para adicionar destaques e efeitos luminosos de lentes.";"CIAffineClamp" = "Realiza uma transformação Affine numa imagem de origem e, a seguir, prende os pixels no contorno da imagem transformada, prolongando-os para fora. Este filtro actua de forma idêntica ao filtro CIAffineTransform, salvo o facto de produzir uma imagem com extensão infinita. Pode utilizar este filtro quando é necessário desfocar uma imagem, mas pretende evitar uma franja suave e preta ao longo dos contornos.";"CIAffineTile" = "Aplica uma transformação Affine a uma imagem e, a seguir, dispõe a imagem transformada em mosaico.";"CIAffineTransform" = "Aplica uma transformação Affine a uma imagem. Pode ajustar a escala, traduzir ou rodar a imagem de entrada. Pode também aplicar uma combinação a estas operações.";"CIBarsSwipeTransition" = "Transições de uma imagem para outra passando partes da imagem de primeiro plano para mostrar a imagem de destino.";"CIBlendWithMask" = "Utiliza valores de uma máscara de escala de cinzentos para interpolar uma imagem e o segundo plano. Se o valor de uma máscara for de 0,0, o resultado é o segundo plano. Se o valor da máscara for de 1,0, o resultado é a imagem.";"CIBloom" = "Suaviza os contornos e aplica um brilho agradável a uma imagem.";"CIBoxBlur" = "Suaviza ou acentua uma imagem utilizando um kernel de convolução em forma de caixa.";"CIBumpDistortion" = "Cria um alto côncavo ou convexo que tem origem num ponto específico na imagem.";"CIBumpDistortionLinear" = "Cria um alto que tem origem numa parte linear da imagem.";"CICMYKHalftone" = "Cria uma representação colorida de meios-tons, utilizando tintas de turquesa, magenta, amarelo e preto numa página branca.";"CICheckerboardGenerator" = "Gera um padrão de tabuleiro de xadrez. Pode especificar o tamanho e as cores do tabuleiro de xadrez, assim como a nitidez do padrão.";"CICircleSplashDistortion" = "Faz a distorção dos pixels com início na circunferência de um círculo e projectando-se para fora.";"CICircularScreen" = "Simula um ecrã de meios-tons circular.";"CICircularWrap" = "Molda uma imagem à volta de um círculo transparente. A distorção da imagem aumenta com a distância a partir do centro do círculo.";"CIColorControls" = "Regula os valores de saturação, brilho e contraste.";"CIColorCube" = "Utiliza uma tabela de cores tridimensional que transforma os pixels da imagem original. A tabela de cores deve ser constituída por células RGBA de ponto flutuante que utilizam alfa pré-multiplicado. As células estão organizadas por uma ordem padrão. As colunas e as filas dos dados são indexadas por vermelho e verde, respectivamente. Cada plano de dados é seguido pelo plano mais alto seguinte nos dados, sendo os planos indexados por azul.";"CIColorInvert" = "Inverte as cores numa imagem.";"CIColorMap" = "Realiza uma transformação não linear de valores de cores originais, utilizando valores de mapeamento apresentados na tabela.";"CIColorMatrix" = "Multiplica os valores das cores originais e adiciona um factor de desequilíbrio a cada componente de cor.";"CIColorMonochrome" = "Remapeia as cores para que fiquem dentro dos tons de uma única cor.";"CIColorPosterize" = "Remapeia os componentes de vermelho, verde e azul de acordo com o número de valores de brilho para cada componente de cores. Este filtro esbate as cores para obter um aspecto idêntico ao de um cartaz coberto a seda.";"CIComicEffect" = "Simula um desenho de livro de banda desenhada realçando os contornos e aplicando um efeito de meios-tons colorido.";"CIConstantColorGenerator" = "Gera uma cor sólida. Normalmente, utiliza o resultado deste filtro como a entrada para outro filtro.";"CICopyMachineTransition" = "Transições de uma imagem para outra estimulando o efeito de uma fotocopiadora.";"CICrop" = "Aplica um corte à imagem. O tamanho e a forma da imagem cortada dependem do rectângulo que especificar.";"CICrystallize" = "Cria blocos a cores em forma de polígonos através da agregação de valores de cores de pixels originais.";"CIDiscBlur" = "Suaviza ou acentua uma imagem utilizando um kernel de convolução em forma de disco.";"CIDisintegrateWithMaskTransition" = "Transições de uma imagem para outra utilizando a forma definida por uma máscara.";"CIDisplacementDistortion" = "Aplica os valores da escala de cinzentos da segunda imagem à primeira imagem. A imagem resultante tem uma textura definida pelos valores da escala de cinzentos.";"CIDissolveTransition" = "Utiliza uma dissolução para transitar de uma imagem para outra.";"CIDotScreen" = "Simula os padrões de pontos de um ecrã de meios-tons.";"CIEdges" = "Procura todos os contornos numa imagem e apresenta-os a cores.";"CIEdgeWork" = "Produz uma representação a preto e branco estilizada que se parece com um entalhe em madeira.";"CIEightfoldReflectedTile" = "Produz uma imagem em mosaico através da aplicação de uma simetria reflectida de 8 vias.";"CIExposureAdjust" = "Ajusta a definição de exposição para uma imagem de forma semelhante ao modo como controla a exposição de uma câmara quando muda a abertura da lente.";"CIFalseColor" = "Mapeia a luminosidade para uma rampa de cores de duas cores. Frequentemente, é utilizada uma cor falsa para processar dados astronómicos e outros científicos, como imagens de ultravioletas e de raios X.";"CIFastBoxBlur" = "Suaviza ou acentua uma imagem utilizando um kernel de convolução em forma de caixa.";"CIFastDiscBlur" = "Suaviza ou acentua uma imagem utilizando um kernel de convolução em forma de disco.";"CIFlashTransition" = "Transições de uma imagem para outra criando um flash. O flash tem origem num ponto que especifica. Pequeno inicialmente, expande-se rapidamente até a moldura da imagem ficar totalmente preenchida com a cor do flash. À medida que a cor se esbate, a imagem de destino começa a aparecer.";"CIFourfoldReflectedTile" = "Produz uma imagem em mosaico através da aplicação de uma simetria reflectida de 4 vias.";"CIFourfoldRotatedTile" = "Produz uma imagem em mosaico através da rotação da origem em incrementos de 90º.";"CIFourfoldTranslatedTile" = "Produz uma imagem em mosaico através da aplicação de 4 operações de tradução.";"CIGammaAdjust" = "Ajusta o brilho dos meios-tons. Normalmente, este filtro é utilizado para compensar os efeitos não lineares do ecrã. O ajuste da gama altera eficazmente a inclinação da tradução entre preto e branco.";"CIGaussianBlur" = "Espalha os pixels de origem por um valor especificado por uma distribuição gaussiana.";"CIGaussianGradient" = "Gera uma gradação que varia de uma cor para outra utilizando a distribuição gaussiana.";"CIGlassDistortion" = "Distorce uma imagem aplicando uma textura tipo vidro. As partes elevadas da imagem resultante são o resultado da aplicação de um mapa de textura.";"CIGlassLozenge" = "Cria uma lente em forma de losango e distorce a imagem sobre a qual a lente é colocada.";"CIGlideReflectedTile" = "Produz uma imagem em mosaico através da tradução e atenuação da imagem.";"CIGloom" = "Esbate os realces de uma imagem.";"CIHatchedScreen" = "Simula o padrão tracejado de um ecrã de meios-tons.";"CIHeightFieldFromMask" = "Produz um campo de altura tridimensional e em forma de sótão a partir de uma máscara de escala de cinzentos. Os valores de branco da máscara definem os pixels que estão no dentro do campo de altura, enquanto os valores de preto definem os pixels que estão fora. O campo varia suave e continuamente dentro da máscara, atingindo o valor de 0 no contorno da máscara. Pode utilizar este filtro com o filtro CIShadedMaterial para produzir objectos de formas extremamente realistas.";"CIHexagonalPixellate" = "Apresenta uma imagem como hexágonos coloridos cuja cor é uma média dos pixels que substituem.";"CIHoleDistortion" = "Cria uma área circular que empurra os pixels da imagem para fora, distorcendo os pixels que estão mais perto do círculo.";"CIHueAdjust" = "Altera a tonalidade ou o tom dos pixels originais.";"CIKaleidoscope" = "Produz uma imagem caleidoscópica através da aplicação de uma simetria reflectida de 12 vias.";"CILanczosScaleTransform" = "Produz uma versão de alta qualidade e dimensionada da imagem original. Normalmente, utiliza este filtro para reduzir uma imagem.";"CILenticularHaloGenerator" = "Simula uma auréola que é gerada pela difracção associada com a amplitude de uma lente. Normalmente, este filtro aplica-se a outra imagem para simular brilhos de lente e efeitos idênticos.";"CILineOverlay" = "Cria um esboço que realça os contornos de uma imagem em preto, deixando transparentes as partes não realçadas da imagem. O resultado tem alfa e é representado a preto, por isso, não se parecerá com grande coisa até o representar sobre outra imagem utilizando a origem sobre a composição.";"CILineScreen" = "Simula o padrão de linhas de um ecrã de meios-tons.";"CILinearGradient" = "Gera uma gradação que varia ao longo de um eixo linear entre dois pontos finais definidos.";"CIMaskToAlpha" = "Converte uma imagem de escala de cinzentos para uma imagem mascarada pelo alfa. Os valores de branco da imagem original produzem o interior da máscara; Os valores de preto ficam totalmente transparentes.";"CIMaximumCompositing" = "Calcula o valor máximo, por componente de cores, de duas imagens entradas e cria uma imagem de saída utilizando os valores máximos. Acção idêntica a ilusão.";"CIMedianFilter" = "Calcula o valor médio para um grupo de pixels vizinhos e substitui cada valor de pixel pelo mediano. O efeito é reduzir o ruído.";"CIMinimumCompositing" = "Calcula o valor mínimo, por componente de cores, de duas imagens entradas e cria uma imagem de saída utilizando os valores mínimos. Acção idêntica a queimar.";"CIModTransition" = "Transições de uma imagem para outra revelando a imagem de destino através de orifícios de formas irregulares.";"CIMotionBlur" = "Desfoca uma imagem para simular uma câmara que se desloca num ângulo e distância específicos ao mesmo tempo que capta a imagem.";"CIMultiplyCompositing" = "Multiplica o componente de cores e cria uma imagem de saída utilizando valores multiplicados. Normalmente, este filtro utiliza-se para adicionar um foco ou efeito idêntico sobre uma imagem.";"CINoiseReduction" = "Reduz o ruído utilizando um valor limite para definir o que é considerado ruído. Pequenas alterações na luminosidade abaixo desse valor são consideradas ruído e recebem um tratamento de redução de ruído, que é uma desfocagem local. As alterações acima do valor limite são considerados contornos, sendo, por isso, avivados.";"CIOpTile" = "Segmenta uma imagem, aplicando um dimensionamento e rotação especificados e, a seguir, volta a montar a imagem para dar um aspecto de arte op.";"CIPageCurlTransition" = "Transições de uma imagem para outra através da simulação de uma página ondulada, revelando a nova imagem quando a página desenrola.";"CIParallelogramTile" = "Deforma uma imagem reflectindo-a num paralelogramo e, a seguir, dispõe o resultado em forma de mosaicos.";"CIPerspectiveTile" = "Aplica uma transformação de perspectiva a uma imagem e, a seguir, dispõe o resultado em mosaico.";"CIPerspectiveTransform" = "Altera a geometria de uma imagem para simular a posição de visualização de alteração do observador. Pode utilizar o filtro de perspectiva para desalinhar uma imagem.";"CIPinchDistortion" = "Cria uma área rectangular que aperta para dentro os pixels de origem, distorcendo os pixels que estão mais perto do círculo.";"CIPixellate" = "Torna uma imagem poliédrica.";"CIPointillize" = "Representa a imagem original num estilo pontilhístico.";"CIRadialGradient" = "Gera uma gradação que varia em termos de raio entre dois círculos com o mesmo centro. É válido para um de dois círculos para se obter um raio de 0.";"CIRandomGenerator" = "Gera uma imagem de extensão infinita cujos valores de pixel são constituídos por um máximo de quatro números aleatórios independentes e distribuídos desigualmente na gama de 0 a 1.";"CIRippleTransition" = "Transições de uma imagem para outra criando uma onde circular que se expande de um ponto central, revelando a nova imagem no aparecimento da onda.";"CISepiaTone" = "Mapeia as cores para vários sombreados de castanho.";"CIShadedMaterial" = "Produz uma imagem sombreada a partir de um campo de altura. O campo de altura é definido para ter alturas maiores com sombras mais claras, e alturas menores (áreas inferiores) com sombras mais escuras. Pode combinar este filtro com o filtro CIHeightFieldFromMask para produzir sombreados rápidos de máscaras, como texto.";"CISharpenLuminance" = "Aumenta o detalhe da imagem dando mais nitidez. Opera na luminosidade da imagem; a crominância dos pixels não é afectada.";"CISixfoldReflectedTile" = "Produz uma imagem em mosaico através da aplicação de uma simetria reflectida de 6 vias.";"CISixfoldRotatedTile" = "Produz uma imagem em mosaico através da rotação da origem em passos de 60º.";"CISourceAtopCompositing" = "Coloca a imagem original sobre a imagem de segundo plano e, a seguir, utiliza a luminosidade da imagem de segundo plano para determinar o que mostrar. O composto mostra a imagem de segundo plano e só as partes da imagem original que estão sobre partes visíveis do segundo plano.";"CISourceInCompositing" = "Utiliza a segunda imagem para definir o que deixar na imagem original, cortando efectivamente a imagem.";"CISourceOutCompositing" = "Utiliza a segunda imagem para definir o que é retirado da primeira imagem.";"CISourceOverCompositing" = "Coloca a segunda imagem sobre a primeira.";"CISpotColor" = "Substitui uma ou mais gamas de cores por cores básicas.";"CISpotLight" = "Aplica o efeito de foco direccional a uma imagem.";"CIStarShineGenerator" = "Gera um padrão de pó mágico. A imagem de saída é normalmente utilizada como entrada para outro filtro";"CIStripesGenerator" = "Gera um padrão de listas. Pode controlar a cor das listas, o espaçamento e o contraste.";"CISunbeamsGenerator" = "Gera um efeito de sol. Normalmente, utiliza o resultado do filtro de raios solares como a entrada para outro filtro composto.";"CISwipeTransition" = "Transições de uma imagem para outra, estimulando uma acção de passagem.";"CITorusLensDistortion" = "Cria uma lente em forma de toro e distorce a imagem sobre a qual a lente é colocada.";"CITriangleTile" = "Mapeia uma parte triangular da imagem para uma área triangular e, a seguir, dispõe o resultado em mosaico.";"CITwelvefoldReflectedTile" = "Produz uma imagem em mosaico através da aplicação de uma simetria reflectida de 12 vias.";"CITwirlDistortion" = "Roda os pixels à volta de um ponto para dar um efeito de pirueta. Pode especificar o número de rotações, assim como o centro e o raio do efeito.";"CIUnsharpMask" = "Aumenta o contraste dos contornos entre pixels de cores diferentes numa imagem.";"CIVortexDistortion" = "Roda os pixels à volta de um ponto para simular um vórtice. Pode especificar o número de rotações, assim como o centro e o raio do efeito. ";"CIWhitePointAdjust" = "Ajusta o ponto branco de referência para uma imagem e mapeia todas as cores da origem utilizando uma nova referência.";"CIZoomBlur" = "Simula o efeito de zoom da câmara ao capturar a imagem.";"CIColorBlendMode" = "Utiliza os valores de luminosidade do segundo plano com os valores de tonalidade e saturação da imagem original. Este modo conserva os níveis de cinzentos na imagem.";"CIColorBurnBlendMode" = "Escurece as amostras da imagem de segundo plano para reflectir as amostras da imagem original. Os valores das amostras da imagem original que especificam branco não produzem qualquer alteração.";"CIColorDodgeBlendMode" = "Aviva as amostras da imagem de segundo plano para reflectir as amostras da imagem original. Os valores das amostras da imagem original que especificam preto não produzem qualquer alteração.";"CIDarkenBlendMode" = "Cria amostras de imagens compostas seleccionando amostras mais escuras (a partir da imagem original ou do segundo plano). O resultado é que as amostras da imagem de segundo plano são substituídas por quaisquer amostras da imagem original mais escuras. Caso contrário, as amostras da imagem de segundo plano ficam inalteradas.";"CIDifferenceBlendMode" = "Subtrai a cor da amostra da imagem original da cor da amostra da imagem de segundo plano, ou o inverso, dependendo de qual amostra apresenta o maior valor de brilho. Os valores da amostra da imagem original que são pretos não produzem qualquer alteração; o branco inverte os valores das cores de segundo plano.";"CIExclusionBlendMode" = "Produz um efeito idêntico ao produzido pelo filtro CIDifferenceBlendMode, mas com um menor contraste. Os valores da amostra da imagem original que são pretos não produzem uma alteração; o branco inverte os valores de cores de segundo plano.";"CIHardLightBlendMode" = "Multiplica ou filtra cores, dependendo da cor da amostra da imagem original. Se a cor da amostra da imagem original for mais clara que 50% de cinzento, o segundo plano é aclarado, tal como se fosse filtrado. Se a cor da amostra da imagem original for mais escura que 50% de cinzento, o segundo plano é escurecido, à semelhança da multiplicação. Se a cor da amostra da imagem original for igual a 50% de cinzento, a imagem original não é alterada. Amostras de imagens que são iguais a preto ou branco puro. O efeito global é idêntico ao que conseguiria obter acendendo um foco desagradável sobre a imagem original.";"CIHueBlendMode" = "Utiliza os valores de luminosidade e saturação do segundo plano com a tonalidade da imagem original.";"CILightenBlendMode" = "Cria amostras de imagens compostas seleccionando as amostras mais claras (a partir da imagem original ou do segundo plano). O resultado é que as amostras da imagem de segundo plano são substituídas por quaisquer amostras da imagem original mais claras. Caso contrário, as amostras da imagem de segundo plano ficam inalteradas.";"CILuminosityBlendMode" = "Utiliza a tonalidade e a saturação do segundo plano com a luminosidade da imagem original. Este modo cria um efeito que é inverso ao efeito criado pelo filtro CIColorBlendMode.";"CIMultiplyBlendMode" = "Multiplica as amostras da imagem original por amostras da imagem de segundo plano. Isto resulta em cores que são, pelo menos, tão escuras como qualquer uma das duas cores de amostra contribuintes.";"CIOverlayBlendMode" = "Multiplica ou filtra as amostras da imagem original com as amostras da imagem de segundo plano, dependendo da cor do segundo plano. O resultado é para sobrepor as actuais amostras da imagem origem, enquanto preserva os realces e as sombras do segundo plano. A cor do segundo plano mistura-se com a imagem original para reflectir a claridade ou escuridão do segundo plano.";"CISaturationBlendMode" = "Utiliza os valores de luminosidade e tonalidade com a saturação da imagem original. As áreas do segundo plano que não têm saturação (isto é, áreas totalmente cinzentas) não produzem uma alteração.";"CIScreenBlendMode" = "Multiplica o inverso das amostras da imagem original pelo inverso das amostras da imagem de segundo plano. Isto resulta em cores que são, pelo menos, tão claras como qualquer uma das duas cores de amostra contribuintes.";"CISoftLightBlendMode" = "Escurece ou aclara as cores, dependendo da cor da amostra da imagem original. Se a cor da amostra da imagem original for mais clara que 50% de cinzento, o segundo plano é aclarado, tal como se fosse iludido. Se a cor da amostra da imagem original for mais escura que 50% de cinzento, o segundo plano é escurecido, como se fosse queimado. Se a cor da amostra da imagem original for igual a 50% de cinzento, o segundo plano não é alterado. Amostras de imagens que são iguais a preto ou branco puro produzem áreas mais escuras ou mais claras, mas não resultam em preto ou branco puro. O efeito global é idêntico ao que conseguiria obter acendendo um foco difuso sobre a imagem original.";"outputImage" = "A imagem produzida por um filtro.";"inputBackgroundImage" = "A imagem a utilizar como uma imagem de segundo plano.";"inputImage" = "A imagem a utilizar como imagem de entrada. Para filtros que também utilizam uma imagem de segundo plano, esta é a imagem de primeiro plano.";"inputTime" = "A duração do efeito.";"inputTransform" = "Uma transformação a aplicar.";"inputScale" = "O valor do efeito.";"inputAspectRatio" = "Uma proporção.";"inputCenter" = "O centro da área, como as coordenadas x e y, para filtrar.";"inputRadius" = "A distância a partir do centro do efeito.";"inputAngle" = "Um ângulo.";"inputRefraction" = "O índice de refracção do material (como vidro) utilizado no efeito.";"inputWidth" = "A largura do efeito.";"inputSharpness" = "A nitidez a aplicar.";"inputIntensity" = "A intensidade do efeito.";"inputEV" = "O número de aberturas de lente mais escuras ou claras para fazer a imagem.";"inputSaturation" = "O valor de ajuste da saturação.";"inputColor" = "Uma cor.";"inputBrightness" = "Um nível de brilho.";"inputContrast" = "Um nível de contraste.";"inputGradientImage" = "Um mapa de ambiente com alfa. Normalmente, é uma imagem que contém realces e sombras.";"inputMaskImage" = "Uma imagem de máscara.";"inputShadingImage" = "Um mapa de ambiente com valores alfa. Normalmente, é uma imagem que contém realces e sombras.";"inputTargetImage" = "A imagem de destino para uma transição.";"inputExtent" = "Um rectângulo que define a extensão do efeito.";"CIBoxBlur.inputRadius" = "O raio determina quantos pixels são utilizados para criar a desfocagem. Quanto maior for o raio, mais desfocado o resultado.";"CIDiscBlur.inputRadius" = "O raio determina quantos pixels são utilizados para criar a desfocagem. Quanto maior for o raio, mais desfocado o resultado.";"CIGaussianBlur.inputRadius" = "O raio determina quantos pixels são utilizados para criar a desfocagem. Quanto maior for o raio, mais desfocado o resultado.";"CIMotionBlur.inputRadius" ="O raio determina quantos pixels são utilizados para criar a desfocagem. Quanto maior for o raio, mais desfocado o resultado.";"CIMotionBlur.inputAngle" = "O ângulo do movimento determina em que direcção a desfocagem é realizada.";"CINoiseReduction.inputNoiseLevel" = "O valor de redução de ruído. Quanto maior for o valor, maior a redução de ruído.";"CINoiseReduction.inputSharpness" = "A nitidez da imagem final. Quanto maior for o valor, maior a nitidez do resultado.";"CIZoomBlur.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";"CIZoomBlur.inputAmount" = "O valor de redução. Quanto maiores forem os valores, maior a redução.";"CIColorControls.inputSaturation" = "A saturação a aplicar. Quanto maior for o valor, mais saturado o resultado.";"CIColorControls.inputBrightness" = "O brilho a aplicar. Quanto maior for o valor, mais brilhante o resultado.";"CIColorControls.inputContrast" = "O contraste a aplicar. Quanto maior for o valor, mais contraste haverá na imagem resultante.";"CIColorMatrix.inputRVector" = "O valor de vermelho pelo qual os valores das cores originais são multiplicados.";"CIColorMatrix.inputGVector" = "O valor de verde pelo qual os valores das cores originais são multiplicados.";"CIColorMatrix.inputBVector" = "O valor de azul pelo qual os valores das cores originais são multiplicados.";"CIColorMatrix.inputAVector" = "O valor de alfa pelo qual os valores das cores originais são multiplicados.";"CIColorMatrix.inputBiasVector" = "Um vector que é adicionado a cada componente de cor.";"CIExposureAdjust.inputEV" = "O valor de ajuste da exposição da imagem. Quanto maior for o valor, mais brilhante a exposição.";"CIGammaAdjust.inputPower" = "O valor gama a utilizar para corrigir o brilho da imagem. Quanto maior for o valor, mais escuro o resultado.";"CIHueAdjust.inputAngle" = "Um ângulo (em graus) a utilizar para corrigir a tonalidade de uma imagem.";"CIWhitePointAdjust.inputColor" = "Uma cor a utilizar como o ponto branco.";"CIColorCube.inputDimension" = "A dimensão da tabela de cores.";"CIColorCube.inputCubeData" = "Esta é uma tabela de cores de células RGBA de ponto flutuante que utilizam alfa pré-multiplicado. As células estão organizadas por uma ordem padrão. As colunas e as filas dos dados são indexadas por vermelho e verde, respectivamente. Cada plano de dados é seguido pelo plano mais alto seguinte nos dados, sendo os planos indexados por azul.";"CIColorMap.inputGradientImage" = "Os dados de imagem desta imagem transformam os valores da imagem original.";"CIColorMonochrome.inputColor" = "A cor monocromática a aplicar à imagem.";"CIColorMonochrome.inputIntensity" = "A intensidade do efeito monocromático. Um valor de 1,0 cria uma imagem monocromática utilizando a cor fornecida. Um valor de 0,0 não produz efeito na imagem.";"CIColorPosterize.inputLevels" = "O número de níveis de brilho a utilizar para cada componente de cores. Os valores menores resultam num efeito de cartaz mais extremo.";"CIFalseColor.inputColor0" = "A primeira cor a utilizar para a rampa de cores.";"CIFalseColor.inputColor1" = "A segunda cor a utilizar para a rampa de cores.";"CISepiaTone.inputIntensity" = "A intensidade do efeito de sépia. Um valor de 1,0 cria uma imagem monocromática de sépia. Um valor de 0,0 não produz efeito na imagem.";"CIBumpDistortion.inputCenter" = "A posição x e y para utilizar como o centro do alto."; "CIBumpDistortion.inputRadius" = "O raio determina quantos pixels são utilizados para criar a distorção. Quanto maior for o raio, maior a amplitude da distorção."; "CIBumpDistortion.inputScale" = "A escala do efeito determina a curvatura do alto. Um valor de 0,0 não produz efeito. Os valores positivos criam um alto para fora; os valores negativos criam um alto para dentro."; "CIBumpDistortionLinear.inputCenter" = "A posição x e y para utilizar como o centro da distorção."; "CIBumpDistortionLinear.inputRadius" = "O raio determina quantos pixels são utilizados para criar a distorção. Quanto maior for o raio, maior a amplitude da distorção.";  "CIBumpDistortionLinear.inputScale" = "A escala do efeito."; "CIBumpDistortionLinear.inputAngle" = "O ângulo (em graus) da linha à volta da qual acontece a distorção."; "CICircleSplashDistortion.inputCenter" = "A posição x e y para utilizar como o centro da distorção.";  "CICircleSplashDistortion.inputRadius" = "O raio determina quantos pixels são utilizados para criar a distorção. Quanto maior for o raio, maior a amplitude da distorção.";  "CICircularWrap.inputCenter" = "A posição x e y para utilizar como o centro da distorção.";  "CICircularWrap.inputRadius" = "O raio determina quantos pixels são utilizados para criar a distorção. Quanto maior for o raio, maior a amplitude da distorção.";  "CICircularWrap.inputAngle" = "O ângulo do efeito."; "CIDisplacementDistortion.inputDisplacementImage" = "Uma imagem cujos valores da escala de cinzentos serão aplicados à imagem original."; "CIDisplacementDistortion.inputScale" = "Texturização da imagem resultante. Quanto maior for o valor, maior a texturização."; "CIGlassDistortion.inputTexture" = "Uma textura para aplicar à imagem.";"CIGlassDistortion.inputCenter" = "A posição x e y para utilizar como o centro da distorção."; "CIGlassDistortion.inputScale" = "Texturização da imagem resultante. Quanto maior for o valor, maior a texturização."; "CIGlassLozenge.inputPoint0" = "A posição x e y que define o centro do círculo numa extremidade do losango."; "CIGlassLozenge.inputPoint1" = "A posição x e y que define o centro do círculo na outra extremidade do losango.";  "CIGlassLozenge.inputRadius" = "O raio do losango. Quanto maior for o raio, maior a extensão da distorção.";  "CIGlassLozenge.inputRefraction" = "A refracção do vidro."; "CIHoleDistortion.inputCenter" = "A posição x e y para utilizar como o centro da distorção.";  "CIHoleDistortion.inputRadius" = "O raio determina quantos pixels são utilizados para criar a distorção. Quanto maior for o raio, maior a amplitude da distorção.";  "CIPinchDistortion.inputCenter" = "A posição x e y para utilizar como o centro da distorção."; "CIPinchDistortion.inputRadius" = "O raio determina quantos pixels são utilizados para criar a distorção. Quanto maior for o raio, maior a amplitude da distorção."; "CIPinchDistortion.inputScale" = "A intensidade do aperto. Um valor de 0,0 não produz efeito. Um valor de 1,0 é o efeito máximo.";"CITorusLensDistortion.inputCenter" = "A posição x e y para utilizar como o centro do toro.";  "CITorusLensDistortion.inputRadius" = "O raio exterior do toro.";  "CITorusLensDistortion.inputWidth" = "A largura do anel."; "CITorusLensDistortion.inputRefraction" = "A refracção do vidro."; "CITwirlDistortion.inputCenter" = "A posição x e y para utilizar como o centro da distorção.";  "CITwirlDistortion.inputRadius" = "O raio determina quantos pixels são utilizados para criar a distorção. Quanto maior for o raio, maior a amplitude da distorção."; "CITwirlDistortion.inputAngle" = "O ângulo (em graus) da pirueta. Os valores podem ser positivos ou negativos.";"CIVortexDistortion.inputCenter" = "A posição x e y para utilizar como o centro da distorção."; "CIVortexDistortion.inputRadius" = "O raio determina quantos pixels são utilizados para criar a distorção. Quanto maior for o raio, maior a amplitude da distorção."; "CIVortexDistortion.inputAngle" = "O ângulo (em graus) do vórtice.";"CICheckerboardGenerator.inputColor0" = "Uma cor a utilizar para o primeiro conjunto dos quadrados do tabuleiro de xadrez.";"CICheckerboardGenerator.inputColor1" = "Uma cor a utilizar para o segundo conjunto dos quadrados do tabuleiro de xadrez.";"CICheckerboardGenerator.inputWidth" = "A largura de um quadrado no padrão do tabuleiro de xadrez.";"CICheckerboardGenerator.inputSharpness" = "A nitidez do padrão do tabuleiro de xadrez. Quanto menor for o valor, mais desfocado o padrão. Os valores variam entre 0,0 e 1,0.";"CIConstantColorGenerator.inputColor" = "A cor a gerar."; "CILenticularHaloGenerator.inputCenter" = "A posição x e y para utilizar como o centro da auréola.";"CILenticularHaloGenerator.inputHaloRadius" = "O raio da auréola.";"CILenticularHaloGenerator.inputHaloWidth" = "A largura da auréola, do seu raio interior ao seu raio exterior.";"CILenticularHaloGenerator.inputOverlap" = "A sobreposição de componentes de difracção da auréola. Um valor de 1,0 é uma sobreposição completa; a auréola é branca. Um valor de 0,0 não produz sobreposição; as cores da auréola não se sobrepõem.";"CILenticularHaloGenerator.inputStriationStrength" = "A intensidade das cores da auréola. Os valores maiores são mais intensos.";"CILenticularHaloGenerator.inputStriationContrast" = "O contraste das cores da auréola. Os valores maiores implicam um contraste maior.";"CIStarShineGenerator.inputCenter" = "A posição x e y para utilizar como o centro da estrela."; "CIStarShineGenerator.inputColor" = "A cor a utilizar para a parede exterior da estrela circular."; "CIStarShineGenerator.inputRadius" = "O raio da estrela."; "CIStarShineGenerator.inputCrossScale" = "O tamanho do padrão cruzado."; "CIStarShineGenerator.inputCrossAngle" = "O ângulo do padrão cruzado."; "CIStarShineGenerator.inputCrossOpacity" = "A opacidade do padrão cruzado."; "CIStarShineGenerator.inputCrossWidth" = "A largura do padrão cruzado."; "CIStarShineGenerator.inputEpsilon" = "O comprimento do padrão cruzado."; "CIStripesGenerator.inputCenter" = "A posição x e y para utilizar como o centro do padrão de listas."; "CIStripesGenerator.inputColor0" = "Uma cor a utilizar para as listas ímpares."; "CIStripesGenerator.inputColor1" = "Uma cor a utilizar para as listas pares.";"CIStripesGenerator.inputWidth" = "A largura de uma lista."; "CIStripesGenerator.inputSharpness" = "A nitidez do padrão das listas. Quanto menor for o valor, mais desfocado o padrão. Os valores variam entre 0,0 e 1,0."; "CISunbeamsGenerator.inputCenter" = "A posição x e y para utilizar como o centro do padrão de raio solar.";"CISunbeamsGenerator.inputColor" = "A cor do sol.";"CISunbeamsGenerator.inputSunRadius" = "O raio do sol.";"CISunbeamsGenerator.inputMaxStriationRadius" = "O raio dos raios solares.";"CISunbeamsGenerator.inputStriationStrength" = "A intensidade dos raios solares. Valores maiores resultam em mais intensidade.";"CISunbeamsGenerator.inputStriationContrast" = "O contraste dos raios solares. Valores maiores resultam em mais contraste.";"CIAffineTransform.inputTransform" = "Uma transformação para aplicar à imagem."; "CICrop.inputRectangle" = "O rectângulo que especifica o corte a aplicar à imagem."; "CILanczosScaleTransform.inputScale" = "O factor de escala a utilizar na imagem. Os valores inferiores a 1,0 reduzem a imagem. Os valores superiores a 1,0 ampliam a imagem."; "CILanczosScaleTransform.inputAspectRatio" = "A proporção da imagem."; "CIPerspectiveTransform.inputTopLeft" = "A coordenada superior esquerda para onde mapear a imagem."; "CIPerspectiveTransform.inputTopRight" = "A coordenada superior direita para onde mapear a imagem."; "CIPerspectiveTransform.inputBottomRight" = "A coordenada inferior direita para onde mapear a imagem."; "CIPerspectiveTransform.inputBottomLeft" = "A coordenada inferior esquerda para onde mapear a imagem."; "CIGaussianGradient.inputColor0" = "A primeira cor a utilizar na gradação."; "CIGaussianGradient.inputColor1" = "A segunda cor a utilizar na gradação."; "CIGaussianGradient.inputRadius" = "O raio da distribuição gaussiana."; "CILinearGradient.inputPoint0" = "A posição inicial da gradação -- onde começa a primeira cor."; "CILinearGradient.inputPoint1" = "A posição final da gradação -- onde começa a segunda cor."; "CILinearGradient.inputColor0" = "A primeira cor a utilizar na gradação.";  "CILinearGradient.inputColor1" = "A segunda cor a utilizar na gradação.";  "CIRadialGradient.inputRadius0" = "O raio do círculo inicial a utilizar a gradação.";"CIRadialGradient.inputRadius1" = "O raio do círculo final a utilizar a gradação.";"CIRadialGradient.inputColor0" = "A primeira cor a utilizar na gradação.";  "CIRadialGradient.inputColor1" = "A segunda cor a utilizar na gradação."; "CICircularScreen.inputCenter" = "A posição x e y para utilizar como o centro do padrão do ecrã circular."; "CICircularScreen.inputWidth" = "A distância entre cada círculo no padrão."; "CICircularScreen.inputSharpness" = "A nitidez dos círculos. Quanto maior for o valor, maior a nitidez dos círculos."; "CICMYKHalftone.inputCenter" = "A posição x e y para utilizar como o centro do padrão de meios-tons.";  "CICMYKHalftone.inputWidth" = "A distância entre pontos no padrão."; "CICMYKHalftone.inputAngle" = "O ângulo do padrão."; "CICMYKHalftone.inputSharpness" = "A nitidez do padrão. Quanto maior for o valor, maior a nitidez do padrão."; "CICMYKHalftone.inputGCR" = "O valor de substituição dos componentes cinzentos. O valor pode variar entre 0,0 (nenhum) e 1,0."; "CICMYKHalftone.inputUCR" = "O valor de remoção da cor subjacente. O valor pode variar entre 0,0 e 1,0. "; "CIDotScreen.inputCenter" = "A posição x e y para utilizar como o centro do padrão do ecrã de pontos.";  "CIDotScreen.inputAngle" = "O ângulo do padrão."; "CIDotScreen.inputWidth" = "A distância entre pontos no padrão."; "CIDotScreen.inputSharpness" = "A nitidez do padrão. Quanto maior for o valor, maior a nitidez do padrão."; "CIHatchedScreen.inputCenter" = "A posição x e y para utilizar como o centro do padrão de ecrã tracejado."; "CIHatchedScreen.inputAngle" = "O ângulo do padrão.";"CIHatchedScreen.inputWidth" = "A distância entre linhas no padrão."; "CIHatchedScreen.inputShaprness" = "A nitidez do padrão. Quanto maior for o valor, maior a nitidez do padrão."; "CILineScreen.inputCenter" = "A posição x e y para utilizar como o centro do padrão do ecrã de linhas.";  "CILineScreen.inputAngle" = "O ângulo do padrão."; "CILineScreen.inputWidth" = "A distância entre linhas no padrão."; "CILineScreen.inputSharpness" = "A nitidez do padrão. Quanto maior for o valor, maior a nitidez do padrão."; 	"CISharpenLuminance.inputSharpness" = "A nitidez a aplicar. Quanto maiores forem os valores, mais nitidez.";"CIUnsharpMask.inputRadius" = "O raio à volta de um pixel dado para aplicar a máscara não nítida. Quanto maior for o raio, uma maior parte da imagem é afectada.";"CIUnsharpMask.inputIntensity" = "A intensidade do efeito. Quanto maior for o valor, mais contraste haverá na área afectada.";"CIBlendWithMask.inputMaskImage" = "Uma máscara de escala de cinzentos. Se o valor de uma máscara for de 0,0, o resultado é o segundo plano. Se o valor da máscara for de 1,0, o resultado é a imagem."; "CIBloom.inputRadius" = "O raio determina quantos pixels são utilizados para criar o efeito. Quanto maior for o raio, maior o efeito.";"CIBloom.inputIntensity" = "A intensidade do efeito. Um valor de 0,0 não produz efeito. Um valor de 1,0 é o efeito máximo."; "CICrystallize.inputRadius" = "O raio determina quantos pixels são utilizados para criar o efeito. Quanto maior for o raio, maiores os cristais resultantes."; "CIEdges.inputIntensity" = "A intensidade dos contornos. Quanto maior for o valor, maior a intensidade."; "CIEdgeWork.inputRadius" = "A espessura dos contornos. Quanto maior for o valor, mais espessos os contornos."; "CIGloom.inputRadius" = "O raio determina quantos pixels são utilizados para criar o efeito. Quanto maior for o raio, maior o efeito."; "CIGloom.inputIntensity" = "A intensidade do efeito. Um valor de 0,0 não produz efeito. Um valor de 1,0 é o efeito máximo."; "CIHeightFieldFromMask.inputImage" = "Os valores de branco da máscara definem os pixels que estão dentro do campo de altura, enquanto os valores de preto definem os pixels que estão fora. O campo varia suavemente e continuamente dentro da máscara, atingindo o valor de 0 no contorno da máscara."; "CIHeightFieldFromMask.inputRadius" = "A distância a partir do contorno da máscara porque a transição suave é proporcional ao raio de entrada. Valores maiores tornam a transição mais suave e mais pronunciada. Valores menores tornam a transição parecida ao raio de uma fita."; "CIHexagonalPixellate.inputCenter" = "A posição x e y para utilizar como o centro do efeito."; "CIHexagonalPixellate.inputScale" = "A escala determina o tamanho dos hexágonos. Os valores maiores dão origem e hexágonos maiores."; "CILineOverlay.inputNRNoiseLevel" = "O nível de ruído da imagem (utilizado com dados de câmara) que é removido antes de traçar os contornos da imagem. Aumentar o nível de ruído ajuda a limpar os contornos traçados da imagem."; "CILineOverlay.inputNRSharpness" = "O realce efectuado ao eliminar o ruído na imagem antes de traçar os contornos da imagem. Esta acção melhora a aquisição de contornos."; "CILineOverlay.inputEdgeIntensity" = "O factor de acentuação da informação da gradação Sobel ao traçar os contornos da imagem. Os valores mais altos encontram mais contornos, embora, normalmente, seja utilizado um valor baixo (como 1,0)."; "CILineOverlay.inputThreshold" = "Este valor determina a visibilidade dos contornos. Os valores maiores tornam os contornos mais finos."; "CILineOverlay.inputContrast" = "O anti-efeito de amostragem a utilizar nos contornos produzidos por este filtro. Os valores mais altos produzem contornos de contraste mais elevado (o efeito anti-amostragem é menor)."; "CIPixellate.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIPixellate.inputScale" = "A escala determina o tamanho dos quadrados. Os valores maiores dão origem a quadrados maiores."; "CIPointillize.inputRadius" = "O raio dos círculos no padrão resultante."; "CIPointillize.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIShadedMaterial.inputShadingImage" = "A imagem a utilizar como o campo de altura. A imagem resultante tem alturas maiores com sombras mais claras e alturas menores (áreas inferiores) com sombras mais escuras."; "CIShadedMaterial.inputScale" = "A escala do efeito. Quanto maior for o valor, mais acentuado o efeito."; "CISpotColor.inputCenterColor1" = "O valor central da primeira gama de cores a substituir."; "CISpotColor.inputReplacementColor1" = "Uma cor de substituição para a primeira gama de cores."; "CISpotColor.inputCloseness1" = "O valor que indica a proximidade da primeira cor antes de ser substituída."; "CISpotColor.inputContrast1" = "O contraste da primeira cor de substituição."; "CISpotColor.inputCenterColor2" = "O valor central da segunda gama de cores a substituir."; "CISpotColor.inputReplacementColor2" = "Uma cor de substituição para a segunda gama de cores.";"CISpotColor.inputCloseness2" = "O valor que indica a proximidade da segunda cor antes de ser substituída."; "CISpotColor.inputContrast2" = "O contraste da segunda cor de substituição."; "CISpotColor.inputCenterColor3" = "O valor central da terceira gama de cores a substituir.";  "CISpotColor.inputReplacementColor3" = "Uma cor de substituição para a terceira gama de cores."; "CISpotColor.inputCloseness3" = "O valor que indica a proximidade da terceira cor antes de ser substituída.";  "CISpotColor.inputContrast3" = "O contraste da terceira cor de substituição.";  "CISpotLight.inputLightPosition" = "A posição x e y do foco."; 		"CISpotLight.inputLightPointsAt" = "A posição x e y para onde o foco aponta.";  "CISpotLight.inputBrightness" = "O brilho do foco."; "CISpotLight.inputConcentration" = "O tamanho do foco. Quanto menor for o valor, maior será a percentagem de focagem do feixe de luz."; "CISpotLight.inputColor" = "A cor do foco."; "CIAffineClamp.inputTransform" = "A transformação para aplicar à imagem."; "CIAffineTile.inputTransform" = "A transformação para aplicar à imagem."; "CIEightfoldReflectedTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIEightfoldReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico."; "CIEightfoldReflectedTile.inputWidth" = "A largura de um mosaico."; "CIFourfoldReflectedTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIFourfoldReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIFourfoldReflectedTile.inputAcuteAngle" = "O ângulo primário para o mosaico reflectido repetido. Pequenos valores criam mosaicos de diamante finos, enquanto valores mais elevados criam mosaicos reflectidos mais espessos."; "CIFourfoldReflectedTile.inputWidth" = "A largura de um mosaico.";  "CIFourfoldRotatedTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIFourfoldRotatedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIFourfoldRotatedTile.inputWidth" = "A largura de um mosaico."; "CIFourfoldTranslatedTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIFourfoldTranslatedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "O ângulo primário para o mosaico traduzido repetido. Pequenos valores criam mosaicos de diamante finos, enquanto valores mais elevados criam mosaicos traduzidos mais espessos."; "CIFourfoldTranslatedTile.inputWidth" = "A largura de um mosaico.";  "CIGlideReflectedTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIGlideReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIGlideReflectedTile.inputWidth" = "A largura de um mosaico.";  "CIKaleidoscope.inputCount" = "O número de reflexões no padrão."; "CIKaleidoscope.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIKaleidoscope.inputAngle" = "O ângulo de reflexão."; "CIOpTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CIOpTile.inputScale" = "A escala determina o número de mosaicos no efeito."; "CIOpTile.inputAngle" = "O ângulo de um mosaico."; "CIOpTile.inputWidth" = "A largura de um mosaico."; "CIParallelogramTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito."; "CIParallelogramTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIParallelogramTile.inputAcuteAngle" = "O ângulo primário para o mosaico paralelogramo repetido. Pequenos valores criam mosaicos de diamante finos, enquanto valores mais elevados criam mosaicos paralelogramos mais espessos."; "CIParallelogramTile.inputWidth" = "A largura de um mosaico.";  "CIPerspectiveTile.inputTopLeft" = "A coordenada superior esquerda de um mosaico."; "CIPerspectiveTile.inputTopRight" = "A coordenada superior direita de um mosaico.";"CIPerspectiveTile.inputBottomRight" = "A coordenada inferior direita de um mosaico."; "CIPerspectiveTile.inputBottomLeft" = "A coordenada inferior esquerda de um mosaico."; "CISixfoldReflectedTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CISixfoldReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CISixfoldReflectedTile.inputWidth" = "A largura de um mosaico."; "CISixfoldRotatedTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito."; "CISixfoldRotatedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CISixfoldRotatedTile.inputWidth" = "A largura de um mosaico.";  "CITriangleTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito.";  "CITriangleTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CITriangleTile.inputWidth" = "A largura de um mosaico.";  "CITwelvefoldReflectedTile.inputCenter" = "A posição x e y para utilizar como o centro do efeito."; "CITwelvefoldReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";"CITwelvefoldReflectedTile.inputWidth" = "A largura de um mosaico."; "CIBarsSwipeTransition.inputAngle" = "O ângulo (em graus) das barras.";	"CIBarsSwipeTransition.inputWidth" = "A largura de cada barra.";	"CIBarsSwipeTransition.inputBarOffset" = "O desfasamento de uma barra relativamente a outra";	"CIBarsSwipeTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CICopyMachineTransition.inputColor" = "A cor da luz da fotocopiadora.";"CICopyMachineTransition.inputAngle" = "O ângulo da luz da fotocopiadora.";"CICopyMachineTransition.inputWidth" = "A largura da luz da fotocopiadora. ";"CICopyMachineTransition.inputOpacity" = "A opacidade da luz da fotocopiadora. Um valor de 0,0 é transparente. Um valor de 1,0 é opaco.";"CICopyMachineTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Uma imagem que define a forma a utilizar ao desintegrar de uma imagem original para uma de destino.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "O raio da sombra criada pela máscara.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "A densidade da sombra criada pela máscara.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "O desfasamento da sombra criada pela máscara.";"CIDisintegrateWithMaskTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CIDissolveTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CIFlashTransition.inputCenter" = "A posição x e y para utilizar como o centro do efeito."; "CIFlashTransition.inputExtent" = "A extensão do flash.";"CIFlashTransition.inputColor" = "A cor dos raios de luz que emanam do flash.";"CIFlashTransition.inputMaxStriationRadius" = "O raio dos raios de luz que emanam do flash.";"CIFlashTransition.inputStriationStrength" = "A força dos raios de luz que emanam do flash.";"CIFlashTransition.inputStriationContrast" = "O contraste dos raios de luz que emanam do flash.";"CIFlashTransition.inputFadeThreshold" = "O esbatimento entre o flash e a imagem de destino. Quanto maior for o valor, maior é o tempo do flash e menor o tempo do esbatimento.";"CIFlashTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CIModTransition.inputCenter" = "A posição x e y para utilizar como o centro do efeito."; "CIModTransition.inputAngle" = "O ângulo do padrão de orifício mod.";"CIModTransition.inputRadius" = "O raio dos orifícios não distorcidos no padrão.";"CIModTransition.inputCompression" = "O estiramento aplicado ao padrão do orifício mod. Os orifícios no centro não são distorcidos tanto quanto os no contorno da imagem.";"CIModTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CIPageCurlTransition.inputBacksideImage" = "A imagem que aparece no verso da imagem original, à medida que a página enrola para revelar a imagem de destino.";"CIPageCurlTransition.inputShadingImage" = "Um imagem que se parece com uma esfera sombreada numa imagem quadrada.";"CIPageCurlTransition.inputExtent" = "A extensão do efeito.";"CIPageCurlTransition.inputAngle" = "O ângulo da página ondulada.";"CIPageCurlTransition.inputRadius" = "O raio da ondulação.";"CIPageCurlTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CIRippleTransition.inputShadingImage" = "Um imagem que se parece com uma esfera sombreada numa imagem quadrada.";"CIRippleTransition.inputCenter" = "A posição x e y para utilizar como o centro do efeito."; "CIRippleTransition.inputExent" = "A extensão do efeito.";"CIRippleTransition.inputWidth" = "A largura da luz da ondulação.";"CIRippleTransition.inputScale" = "Um valor que determina se a onda começa como uma convexidade (valor maior) ou uma concavidade (menor valor).";"CIRippleTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CISwipeTransition.inputExtent" = "A extensão do efeito.";"CISwipeTransition.inputColor" = "A cor da passagem.";"CISwipeTransition.inputAngle" = "O ângulo da passagem.";"CISwipeTransition.inputWidth" = "A largura da passagem.";"CISwipeTransition.inputOpacity" = "A opacidade da passagem.";"CISwipeTransition.inputTime" = "O tempo paramétrico da transição. Este valor realiza a transição do início (tempo 0) até ao fim (tempo 1).";"CIAreaHistogram" = "Calcula um histograma para a área especificada de uma imagem, devolvendo o resultado numa imagem 1D.";"CIAreaHistogram.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIAreaHistogram.inputCount" = "O número de compartimentos do histograma.";"CIAreaHistogram.inputImage" = "A imagem cujo histograma pretende calcular.";"CIAreaHistogram.inputScale" = "O valor de escala a utilizar nos valores do histograma.";"CIAreaMaximum" = "Calcula os valores de componente máximos para a área especificada de uma imagem, devolvendo o resultado num pixel.";"CIAreaMaximum.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIAreaMaximum.inputImage" = "A imagem a processar.";"CIAreaMinimum" = "Calcula os valores de componente mínimos para a área especificada de uma imagem, devolvendo o resultado num pixel.";"CIAreaMinimum.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIAreaMinimum.inputImage" = "A imagem a processar.";"CIAreaMaximumAlpha" = "Localiza e devolve o pixel com o valor alfa máximo.";"CIAreaMaximumAlpha.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIAreaMaximumAlpha.inputImage" = "A imagem a processar.";"CIAreaMinimumAlpha" = "Localiza e devolve o pixel com o valor alfa mínimo.";"CIAreaMinimumAlpha.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIAreaMinimumAlpha.inputImage" = "A imagem a processar.";"CIAreaAverage" = "Calcula a cor média para a área especificada de uma imagem, devolvendo o resultado num pixel.";"CIAreaAverage.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIAreaAverage.inputImage" = "A imagem a processar.";"CIRowAverage" = "Calcula a cor média para cada linha da área especificada da imagem, devolvendo o resultado numa imagem 1D.";"CIRowAverage.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIRowAverage.inputImage" = "A imagem a processar.";"CIColumnAverage" = "Calcula a cor média para cada coluna da área especificada da imagem, devolvendo o resultado numa imagem 1D.";"CIColumnAverage.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIColumnAverage.inputImage" = "A imagem a processar.";"CIMinimumComponent" = "Converte uma imagem para níveis de cinzento utilizando o mínimo dos três componentes de cor.";"CIMinimumComponent.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIMinimumComponent.inputImage" = "A imagem a processar.";"CIMaximumComponent" = "Converte uma imagem para níveis de cinzento utilizando o máximo dos três componentes de cor.";"CIMaximumComponent.inputExtent" = "Um rectângulo que especifica a sub-região da imagem que pretende processar.";"CIMaximumComponent.inputImage" = "A imagem a processar.";